In [146]:
import sqlalchemy
import numpy as np
import pandas as pd
from credentials import username
from credentials import password
from  psycopg2 import connect
from decimal import Decimal
from sqlalchemy import Column, ForeignKey,Table, Integer, String, Float, Boolean, MetaData, create_engine
from sqlalchemy.orm import relationship, backref

In [147]:
rds_connection_string = f'{username}:{password}@localhost:5433/Project2'
engine = create_engine(f'postgresql://{rds_connection_string}')

In [134]:
meta = MetaData(engine)

NJ_CountyMonthly_Avg = Table('countyavg', meta, 
    Column('id', Integer, primary_key = True), 
    Column('Year', Integer), 
    Column('County', String),
    Column('Jan', Float),
    Column('Feb', Float),
    Column('Mar', Float),
    Column('Apr', Float),
    Column('May', Float),
    Column('Jun', Float),
    Column('Jul', Float),
    Column('Aug', Float),
    Column('Sep', Float),
    Column('Oct', Float),
    Column('Nov', Float),
    Column('Dec', Float),
    
)
meta.create_all(engine)

In [148]:
meta2 = MetaData(engine)

NJ_Monthly = Table('monthlyavg', meta2, 
    Column('id', Integer, primary_key = True),  
    Column('County', String),
    Column('Jan', Float),
    Column('Feb', Float),
    Column('Mar', Float),
    Column('Apr', Float),
    Column('May', Float),
    Column('Jun', Float),
    Column('Jul', Float),
    Column('Aug', Float),
    Column('Sep', Float),
    Column('Oct', Float),
    Column('Nov', Float),
    Column('Dec', Float),
    
)
meta2.create_all(engine)

In [135]:
csv_all = 'All_Merged.csv'

df = pd.read_csv(csv_all)
del df['Unnamed: 0']

df.head()

# df['Year']= df['Year'].astype(int)
# df['']= df['Year'].astype(int)
# df['Jan']= df['Jan'].astype(float)
# df['Feb']= df['Feb'].astype(float)


# months = ["Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"]
# for m in months:
#     df[m] = df[m].apply(lambda x: str(x)[0:4])
#     pd.to_numeric(df[m], errors='coerce')
# df.to_csv('All_Merged.csv')

,Year,County,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,1970,Atlantic,25.10,33.20,37.60,49.20,61.40,68.60,73.40,74.20,69.40,57.60,46.80,35.80
1,1971,Atlantic,28.40,35.00,39.30,48.20,57.60,70.00,73.10,71.70,68.30,61.30,44.60,41.40
2,1972,Atlantic,34.40,32.40,39.40,47.50,59.50,66.20,74.70,72.50,67.00,51.30,43.40,40.90
3,1973,Atlantic,34.60,33.10,46.60,51.60,58.30,71.80,74.90,75.20,67.70,57.30,47.00,38.60
4,1974,Atlantic,37.30,32.00,43.30,53.40,60.10,67.40,74.60,73.70,65.90,51.90,46.00,38.40

In [129]:
df.info()
# df['Year'].unique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 14 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    1050 non-null   int64
 1   County  1050 non-null   object
 2   Jan     1050 non-null   float64
 3   Feb     1050 non-null   float64
 4   Mar     1050 non-null   float64
 5   Apr     1050 non-null   float64
 6   May     1050 non-null   float64
 7   Jun     1050 non-null   float64
 8   Jul     1050 non-null   float64
 9   Aug     1050 non-null   float64
 10  Sep     1050 non-null   float64
 11  Oct     1050 non-null   float64
 12  Nov     1050 non-null   float64
 13  Dec     1050 non-null   float64
dtypes: float64(12), int64(1), object(1)
memory usage: 115.0+ KB

In [136]:
# Table CountyAvg
df.to_sql(name='countyavg', con=engine, if_exists='append', index=False)

In [149]:
csv_monthly = 'All_Merged_Monthly_Averages.csv'
df2 = pd.read_csv(csv_monthly)

# Table MonthlyAvg
df2.to_sql(name='monthlyavg', con=engine, if_exists='append', index=False)